In [70]:
a = 'ASDSVDfdsfdsvdKKsfdSDSVSVDFD'

print(sum(1 for i in a if i.isupper()))

17

In [71]:
import re

a = 'Hi, This is an example'
b='^Hi'

c= 'This'

print(bool(re.match(b,a))) # Correct match
print(bool(re.match(c,a))) # Mismatch

True
False

In [75]:
import pandas as pd
from io import StringIO

# Provide the file path to your CSV file
file_path = r'C:\Users\Futurense\Downloads\test.csv'

with open(file_path, 'r', encoding='utf-8') as file:
    modified_content = file.read().replace('“', '').replace('”', '')

df = pd.read_csv(StringIO(modified_content))

# Display the DataFrame
df.head()

      FirstName     LastName  Age Gender
0  1stFirstName  1stLastName   10      M
1  2ndFirstName  2ndLastName   13      F

In [76]:
L = [1, 2, 1, 3, 4, 2, 3]
print(len(set(L)), set (L))

4 {1, 2, 3, 4}

In [77]:
df.to_json()

'{"FirstName":{"0":"1stFirstName","1":"2ndFirstName"},"LastName":{"0":"1stLastName","1":"2ndLastName"},"Age":{"0":10,"1":13},"Gender":{"0":"M","1":"F"}}'

In [81]:
input_json = {
    "users": [
        {
            "id": 1,
            "name": "ram",
            "dob": "1980-01-10",
            "age": 39,
            "qualifications": ["BE", "MBA"]
        },
        {
            "id": 2,
            "name": "sita",
            "dob": "1990-01-10",
            "age": 29,
            "qualifications": ["MBBS", "MD"]
        }
    ]
}

output = {"users":[]}
for i in input_json["users"]:
    for j in i["qualifications"]:
        a = {
            "id" : i["id"],
            "name": i["name"],
            "dob":i["dob"],
            "age":i["age"],
            "qualifications" : j
        }
        output["users"].append(a)

In [80]:
output

{'users': [{'id': 1,
   'name': 'ram',
   'dob': '1980-01-10',
   'age': 39,
   'qualifications': 'BE'},
  {'id': 1,
   'name': 'ram',
   'dob': '1980-01-10',
   'age': 39,
   'qualifications': 'MBA'},
  {'id': 2,
   'name': 'sita',
   'dob': '1990-01-10',
   'age': 29,
   'qualifications': 'MBBS'},
  {'id': 2,
   'name': 'sita',
   'dob': '1990-01-10',
   'age': 29,
   'qualifications': 'MD'}]}

In [86]:
df1 = pd.DataFrame(output["users"])
df1

   id  name         dob  age qualifications
0   1   ram  1980-01-10   39             BE
1   1   ram  1980-01-10   39            MBA
2   2  sita  1990-01-10   29           MBBS
3   2  sita  1990-01-10   29             MD